export type Question = {
  id: number
  question: string
  options: string[]
}

export const QUESTIONS: Question[] = [
  {
    id: 1,
    question: "Какая основная цель анализа данных?",
    options: [
      "Маркетинг",
      "Финансы",
      "Научные исследования",
      "Бизнес аналитика"
    ]
  },
  {
    id: 2,
    question: "Какой объём данных вы анализируете?",
    options: [
      "Малый (<1GB)",
      "Средний (1–10GB)",
      "Большой (10GB+)"
    ]
  },
  {
    id: 3,
    question: "Нужна ли визуализация данных?",
    options: [
      "Да",
      "Нет",
      "Иногда"
    ]
  },
  {
    id: 4,
    question: "Какой у вас уровень программирования?",
    options: [
      "Начальный",
      "Средний",
      "Продвинутый"
    ]
  },
  {
    id: 5,
    question: "Где будет использоваться аналитика?",
    options: [
      "Бизнес",
      "Образование",
      "Исследования"
    ]
  },
  {
    id: 6,
    question: "Нужна ли работа с Big Data?",
    options: [
      "Да",
      "Нет"
    ]
  },
  {
    id: 7,
    question: "Нужна ли автоматизация аналитики?",
    options: [
      "Да",
      "Нет"
    ]
  }
]